/*******************************************************************************
* タイトル:		コンピューターヘッダ
* プログラム名:		compter.h
* 作成者:		CP11SATA  15  Kim Nakamura
* 作成日:		2016/02/20
********************************************************************************
* 更新履歴:		- 2016/02/20　Kim Nakamura
*			- V1.00　Initial Version
*******************************************************************************/
/*******************************************************************************
* 二重インクルードの防止 
*******************************************************************************/
#ifndef _COMPUTER_H_
#define _COMPUTER_H_

/*******************************************************************************
* インクルードファイル
*******************************************************************************/


/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define THREE           (3)			// コンピューターの数

/*******************************************************************************
* 構造体定義
*******************************************************************************/
typedef struct
{
	int   nCnt;			// コンピューターの場所
	int   nKind;		// コンピューターの種類

	float fPosX;		// コンピューターの初期位置〔横軸〈Ｘ〉〕
	float fPosY;		// コンピューターの初期位置〔縦軸〈Ｙ〉〕

	float fPosXOld;		// コンピューターの移動後位置の格納〔横軸〈Ｘ〉〕
	float fPosYOld;		// コンピューターの移動後位置の格納〔縦軸〈Ｙ〉〕

	float fMoveX;		// コンピューターの移動量〔横軸〈Ｘ〉〕
	float fMoveY;		// コンピューターの移動量〔縦軸〈Ｙ〉〕

	float fCountTimer;	// コンピューターの使うタイマー

	bool  bJump;		// ジャンプしているかどうか
	bool  bPushButton;	// ボタンが押されているかどうか
	bool  bUseCOM;		// 何体使っている？
	bool  bGoal;		// ゴールしたか

}COMPUTER;

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitComputer   ( void );
void UpdateComputer ( void );
void DrawComputer   ( void );
void UninitComputer ( void );

// コンピューター情報のコピーを公開
COMPUTER *GetComputer( void );

// コンピューターインターフェース
void SetCom( float fPosX, float fPosY, int nKind);

/*******************************************************************************
 インクルードファイルの二重インクルードの防止の閉じ
*******************************************************************************/
#endif
