/*******************************************************************************
* タイトル:		プレイヤーヘッダ
* プログラム名:		player.h
* 作成者:		CP11SATA  15  Kim Nakamura
* 作成日:		2016/02/20
********************************************************************************
* 更新履歴:		- 2016/02/20　Kim Nakamura
*			- V1.00　Initial Version
*******************************************************************************/
/*******************************************************************************
* 二重インクルードの防止 
*******************************************************************************/
#ifndef _PLAYER_H_
#define _PLAYER_H_

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#define MAX_HORAIZONTAL (40)	// ２バイト文字最大Ｘ軸
#define MAX_VERTICAL    (25)	// ２バイト文字最大Ｙ軸
#define SLOW            (0.15f)	// 任意の減速量

/*******************************************************************************
* マクロ定義
*******************************************************************************/


/*******************************************************************************
* 構造体定義
*******************************************************************************/
typedef struct
{
	int nPointGeter;		// プレイヤーのポイント

	float fPosX;			// プレイヤーの初期位置〔横軸〈Ｘ〉〕
	float fPosY;			// プレイヤーの初期位置〔縦軸〈Ｙ〉〕
	float fPosXOld;			// プレイヤーの移動後位置の格納〔横軸〈Ｘ〉〕
	float fPosYOld;			// プレイヤーの移動後位置の格納〔縦軸〈Ｙ〉〕

	float fMoveX;			// プレイヤーの移動量〔横軸〈Ｘ〉〕
	float fMoveY;			// プレイヤーの移動量〔縦軸〈Ｙ〉〕

	float fCountTimer;		// プレイヤーの使うタイマー

	bool  bJump;			// ジャンプしているかどうか
	bool  bPushButton;		// ボタンが押されているかどうか

}PLAYER;

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitPlayer   ( void );
void UpdatePlayer ( void );
void DrawPlayer   ( void );
void UninitPlayer ( void );

// プレイヤー情報のコピーを公開
PLAYER *GetPlayer( void );

/*******************************************************************************
 インクルードファイルの二重インクルードの防止の閉じ
*******************************************************************************/
#endif
