/*=============================================================================

 バックグラウンドヘッダ[ bg.h ]

=============================================================================*/
/*-----------------------------------------------------------------------------
 インクルードガード
-----------------------------------------------------------------------------*/
#ifndef _BG_H_
#define _BG_H_

/*-----------------------------------------------------------------------------
 クラス定義：シーン３Ｄ継承
-----------------------------------------------------------------------------*/
class CBg
{
	private:

		// 頂点バッファインターフェース
		static LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;

		// テクスチャタイプ
		static int m_nTexType;

		// ポジション
		static D3DXVECTOR3 m_Pos;

		// サイズ
		static D3DXVECTOR3 m_Size;

	public:

	// 各処理関数
	static HRESULT Init(int nTexType);
	static void    Uninit(void);
	static void    Update(void);
	static void    Draw(void);

};

/*-----------------------------------------------------------------------------
 インクルードエンド
-----------------------------------------------------------------------------*/
#endif
