/*=============================================================================

 コリジョンヘッダ[ collision.h ]

=============================================================================*/
/*-----------------------------------------------------------------------------
 インクルードガード
-----------------------------------------------------------------------------*/
#ifndef _COLLISION_H_
#define _COLLISION_H_

/*-----------------------------------------------------------------------------
 インクルードファイル
-----------------------------------------------------------------------------*/
#include "manager.h"

/*-----------------------------------------------------------------------------
 クラス定義
-----------------------------------------------------------------------------*/
class C2DCollision
{
	public:

		/*------------------
		 衝突場所：列挙定義
		------------------*/
		enum COLDIR {
			NONE = -1,	// なし
			UP,			// ０：上
			BOTTOM,		// １：下
			LEFT,		// ２：左
			RIGHT		// ３：右
		};

		// 矩形同士
		static bool ColRect
		(D3DXVECTOR3 posA, D3DXVECTOR3 sizeA, D3DXVECTOR3 posB, D3DXVECTOR3 sizeB);

		// 矩形同士：向きの取得
		static COLDIR ColRect_Dir
		(D3DXVECTOR3 posA, D3DXVECTOR3 sizeA, D3DXVECTOR3 posB, D3DXVECTOR3 sizeB);

		// 矩形と点
		static bool ColPoint_Rect
		(D3DXVECTOR3 point, D3DXVECTOR3 pos, D3DXVECTOR3 size);

		// 点と線
		static bool ColPoint_Line
		(D3DXVECTOR3 point, D3DXVECTOR3 lineStart, D3DXVECTOR3 lineEnd) {}

};

/*-----------------------------------------------------------------------------
 インクルードエンド
-----------------------------------------------------------------------------*/
#endif
