/*=============================================================================

 データ管理ヘッダ[ data.h ]

=============================================================================*/
/*-----------------------------------------------------------------------------
 インクルードガード
-----------------------------------------------------------------------------*/
#ifndef _DATA_H_
#define _DATA_H_

// ファイル名
#define TEXT_NAME_TUTORIAL "DATA/FILE/tutorial.csv"
#define TEXT_NAME_TSAGE1 "DATA/FILE/stage001.csv"
#define TEXT_NAME_TSAGE2 "DATA/FILE/stage002.csv"
#define TEXT_NAME_TSAGE3 "DATA/FILE/stage003.csv"
#define TEXT_NAME_TSAGE4 "DATA/FILE/stage004.csv"
#define TEXT_NAME_TSAGE5 "DATA/FILE/stage005.csv"
#define TEXT_NAME_TSAGE6 "DATA/FILE/stage006.csv"

/*-----------------------------------------------------------------------------
 オブジェクトデータ構造体定義
-----------------------------------------------------------------------------*/
struct OBJ_BASE
{
	int nType;				// タイプ
	int nSubType;			// 派生タイプ
	int nTexType;			// テクスチャタイプ
	D3DXVECTOR3 pos;		// ポジション
	D3DXVECTOR3 size;		// サイズ
};

/*-----------------------------------------------------------------------------
 クラス定義
-----------------------------------------------------------------------------*/
class CData
{
	public:

		// データのロード：読み込みたいデータ
		static void Load(const char *pFileName);

};

/*-----------------------------------------------------------------------------
 インクルードエンド
-----------------------------------------------------------------------------*/
#endif
