/*=============================================================================

 ゴールフレームヘッダ[ bg.h ]

=============================================================================*/
/*-----------------------------------------------------------------------------
 インクルードガード
-----------------------------------------------------------------------------*/
#ifndef _GOALFRAME_H_
#define _GOALFRAME_H_

/*-----------------------------------------------------------------------------
 クラス定義：シーン３Ｄ継承
-----------------------------------------------------------------------------*/
class CGoalFrame
{
	private:

		// 頂点バッファインターフェース
		static LPDIRECT3DVERTEXBUFFER9 m_pVtxBuffFrame;
		static LPDIRECT3DVERTEXBUFFER9 m_pVtxBuffIcon;

		// ポジション
		static D3DXVECTOR3 m_Pos;

	public:

		// 各処理関数
		static HRESULT Init(D3DXVECTOR3 pos);
		static void    Uninit(void);
		static void    Update(void);
		static void    Draw(void);

};

/*-----------------------------------------------------------------------------
 インクルードエンド
-----------------------------------------------------------------------------*/
#endif
