/*=============================================================================

 ハーフフェードヘッダ[ halfFade.h ]

=============================================================================*/
/*-----------------------------------------------------------------------------
 インクルードガード
-----------------------------------------------------------------------------*/
#ifndef _HALFFADE_H_
#define _HALFFADE_H_

/*-----------------------------------------------------------------------------
 インクルードファイル
-----------------------------------------------------------------------------*/
#include "scene2D.h"

/*-----------------------------------------------------------------------------
 クラス定義
-----------------------------------------------------------------------------*/
class CHalfFade : public CScene2D
{
	public:

		// フェード状態の列挙型
		enum FADE
		{
			FADE_NONE = 0,		// なし
			FADE_IN,			// フェードイン
			FADE_OUT,			// フェードアウト
			FADE_MAX			// 最大
		};

	private:

		// フェードの状態
		FADE m_Fade;

		// カラー状態
		D3DXCOLOR m_Color;

	public:

		CHalfFade() { SetObjType(TYPE_HALFFADE); }
		~CHalfFade() {}

		// 生成処理
		static CHalfFade *Create(int nTexType, D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXCOLOR color);

		// 各処理関数
		HRESULT Init(int nTexType, D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXCOLOR color);
		void    Uninit(void);
		void    Update(void);
		void    Draw(void);

		// セット
		void SetFade(FADE fade) { m_Fade = fade; }

		// ゲットカラー
		float GetColor(void) { return m_Color.a; }

};

/*-----------------------------------------------------------------------------
 インクルードエンド
-----------------------------------------------------------------------------*/
#endif