/*=============================================================================

 光源処理ヘッダ[ light.h ]

=============================================================================*/
/*-----------------------------------------------------------------------------
 インクルードガード
-----------------------------------------------------------------------------*/
#ifndef _LIGHT_H_
#define _LIGHT_H_

/*-----------------------------------------------------------------------------
 インクルードファイル
-----------------------------------------------------------------------------*/
#include "manager.h"

/*-----------------------------------------------------------------------------
 クラス定義：シーン共通継承
-----------------------------------------------------------------------------*/
class CLight
{
	private:

	public:

		// コンストラクタ & デスクトラクタ
		CLight() {}
		~CLight() {}

		// 各処理関数
		static HRESULT Set (void)
		{
			// デバイスの取得
			LPDIRECT3DDEVICE9 pDevice = CRenderer::GetDevice();

			// ライトの設定
			D3DLIGHT9 light;

			// ライト構造体のサイズ分の初期化
			ZeroMemory(&light, sizeof(D3DLIGHT9));

			// ライトの種類設定
			light.Type = D3DLIGHT_DIRECTIONAL;

			// ライトの詳細設定
			light.Position = D3DXVECTOR3(0.0f, 0.0f, 0.0f);			// ライトのポジション：ポイント・スポットのみ
			light.Range = 100.0f;									// ライトの届く距離：ポイント・スポットのみ
			light.Theta = 0.0f;										// 照らす範囲：スポットのみ

			// ライトの光源効果の設定
			light.Diffuse = D3DXCOLOR(0.9f, 0.9f, 0.9f, 1.0f);
			light.Ambient = D3DXCOLOR(1.0f, 1.0f, 1.0f, 0.5f);

			// ライトベクトルの設定
			D3DXVECTOR3 vecDir = D3DXVECTOR3(0.0f, 0.0f, 1.0f);

			// ノーマライズ
			D3DXVec3Normalize((D3DXVECTOR3*)&light.Direction, &vecDir);

			// デバイスにライトの設定
			pDevice -> SetLight(0, &light);							// ０番ライトの設定
			pDevice -> LightEnable(0, true);						// ライトの使用可能状態に設定
			pDevice -> SetRenderState(D3DRS_LIGHTING, true);		// ライティング

			// 正常終了
			return S_OK;

		}//end

};

/*-----------------------------------------------------------------------------
 インクルードエンド
-----------------------------------------------------------------------------*/
#endif
