/*=============================================================================

 ナンバーヘッダ[ number.h ]

=============================================================================*/
/*-----------------------------------------------------------------------------
 インクルードガード
-----------------------------------------------------------------------------*/
#ifndef _NUMBER_H_
#define _NUMBER_H_

/*-----------------------------------------------------------------------------
 クラス定義
-----------------------------------------------------------------------------*/
class CNumber
{
	private:

		// 頂点バッファインターフェース
		LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;

		// ポジション
		D3DXVECTOR3 m_Pos;

		// サイズ
		D3DXVECTOR3 m_Size;

		// テクスチャタイプ
		int m_nTexType;

	public:

		CNumber() {}
		~CNumber() {}

		// 生成処理
		static CNumber *Create(int nTexType, D3DXVECTOR3 pos, D3DXVECTOR3 size, int nNumber);

		// 各処理関数
		HRESULT Init (int nTexType, D3DXVECTOR3 pos, D3DXVECTOR3 size, int nNumber);
		void    Uninit(void);
		void    Draw  (void);

		// ナンバーセット
		void SetNumber(int nNumber);

};

/*-----------------------------------------------------------------------------
 インクルードエンド
-----------------------------------------------------------------------------*/
#endif