/*=============================================================================

ステージセレクトヘッダ[ stageSelect.h ]

=============================================================================*/
/*-----------------------------------------------------------------------------
インクルードガード
-----------------------------------------------------------------------------*/
#ifndef _STAGESELECT_H_
#define _STAGESELECT_H_

/*-----------------------------------------------------------------------------
インクルードファイル
-----------------------------------------------------------------------------*/
#include "scene3D.h"

/*-----------------------------------------------------------------------------
クラス定義：シーン３Ｄ継承
-----------------------------------------------------------------------------*/
class CStageSelect : public CScene3D
{
	private:

		D3DXCOLOR m_color;
		int			m_nCounterState;		// 状態カウンタ
		float		m_fAlpha;				// アルファ値
		int			m_nAlphaPlus;

	public:

		// コンストラクタ & デスクトラクタ
		CStageSelect() {}
		~CStageSelect() {}

		// 生成関数
		static CStageSelect *Create(int nTexType, D3DXVECTOR3 pos, D3DXVECTOR3 size);

		// 各処理関数
		HRESULT Init(int nTexType, D3DXVECTOR3 pos, D3DXVECTOR3 size);
		void    Uninit(void) { CScene3D::Uninit(); }
		void    Update(void);
		void    Draw(void) { CScene3D::Draw(); }

};

/*-----------------------------------------------------------------------------
インクルードエンド
-----------------------------------------------------------------------------*/
#endif
