/*=============================================================================

 スイッチヘッダ[ switch.h ]

=============================================================================*/
/*-----------------------------------------------------------------------------
 インクルードガード
-----------------------------------------------------------------------------*/
#ifndef _SWITCH_H_
#define _SWITCH_H_

/*-----------------------------------------------------------------------------
 インクルードファイル
-----------------------------------------------------------------------------*/
#include "scene3D.h"

/*-----------------------------------------------------------------------------
 クラス定義：シーン３Ｄ継承
-----------------------------------------------------------------------------*/
class CSwitch : public CScene3D
{
	private:

		// 判定フラグ
		bool m_bSwitch;

		// 対応するフィールドの番号
		int m_nFieldID;

		// 向き
		enum DIRECTION
		{
			UP = 0,
			BOTTOM,
			LEFT,
			RIGHT
		};

		// テクスチャアニメーション
		float m_fTexX;
		int   m_nTimer;
		
		void Animtion(void);

		// 衝突判定処理
		void CollisionObj(void);

	public:

		// コンストラクタ & デスクトラクタ
		CSwitch();
		~CSwitch();

		// 生成関数
		static CSwitch *Create(int nTexType, D3DXVECTOR3 pos, D3DXVECTOR3 size, int nFieldID);

		// 各処理関数
		HRESULT Init(int nTexType, D3DXVECTOR3 pos, D3DXVECTOR3 size, int nFieldID);
		void    Uninit(void);
		void    Update(void);
		void    Draw(void);

		// 番号の取得
		int GetFieldID(void) { return m_nFieldID; }

};

/*-----------------------------------------------------------------------------
 インクルードエンド
-----------------------------------------------------------------------------*/
#endif
