/*=============================================================================

 テキストテクスチャヘッダ[ textTexture.h ]

=============================================================================*/
/*-----------------------------------------------------------------------------
 インクルードガード
-----------------------------------------------------------------------------*/
#ifndef _TEXTTEXTURE_H_
#define _TEXTTEXTURE_H_

/*-----------------------------------------------------------------------------
 インクルードファイル
-----------------------------------------------------------------------------*/
#include "scene2D.h"

/*-----------------------------------------------------------------------------
クラス定義
-----------------------------------------------------------------------------*/
class CTextTexture : public CScene2D
{
	private:

		// カーソル
		static int m_nCursor;

	public:

		CTextTexture() { SetObjType(TYPE_TEXTTEXTURE); }
		~CTextTexture() {}

		// 生成処理
		static CTextTexture *Create(int nTexType, D3DXVECTOR3 pos, D3DXVECTOR3 size);

		// 各処理関数
		HRESULT Init(int nTexType, D3DXVECTOR3 pos, D3DXVECTOR3 size);
		void    Uninit(void);
		void    Update(void);
		void    Draw(void);

};

/*-----------------------------------------------------------------------------
インクルードエンド
-----------------------------------------------------------------------------*/
#endif